IDEA Open Model
LoadCase.Settlements Property
Compatible with IDEA StatiCa v 10.1
 Settlements in this load case
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public List<ReferenceElement> Settlements { get; set; }
Public Property Settlements As List(Of ReferenceElement)
	Get
	Set
public:
property List<ReferenceElement^>^ Settlements {
	List<ReferenceElement^>^ get ();
	void set (List<ReferenceElement^>^ value);
}
Property Value
Type: List<ReferenceElement>
See Also
Reference
LoadCase Class
IdeaRS.OpenModel.Loading Namespace